
## Terraform plan for environment: `prep`

**Commit:** cd70997f703dc12fbc07e4f18c2c8ffc79e859f2


**API version:** release-v6.1.2
**CLI version:** release-v6.1.2
**Selfserve version:** release-v6.1.2
**Internal version:** release-v6.1.2

### Plan summary

`0 to add, 23 to change, 0 to destroy`

**📖 Reads**

```tf
module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0]
```
**🔄 Updates**

```tf
module.service.module.batch.aws_batch_job_definition.this["import-anondb"]
module.service.module.batch.aws_batch_job_definition.this["ni-compliance"]
module.service.module.batch.aws_batch_job_definition.this["populate-anondb"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-general"]
module.service.module.batch.aws_batch_job_definition.this["sas-mi-extract"]
module.service.module.eventbridge.aws_iam_policy.additional_inline[0]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-company-profile-dlq"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-flag-urgent-tasks"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-licence-status-rules"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-company-profile"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-insolvency"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-insolvency-dlq"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-community-licences"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-disc-generation"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-disc-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-ecmt-accept"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-general"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-irhp-allocate"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-permit-generation"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-permit-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-resolve-payments"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-transxchange-consumer"]
```


----

<details data-gh-workflow="prep-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.service.module.batch.aws_batch_job_definition.this["import-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-anondb:65" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v6.1.2"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "PP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prep.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.pre.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prep.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "release-v6.1.2"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prep.olcs.dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-anondb:65"
        name                       = "vol-app-prep-import-anondb"
      ~ revision                   = 65 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ni-compliance"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ni-compliance:65" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v6.1.2"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "PP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prep.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.pre.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prep.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "release-v6.1.2"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prep.olcs.dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ni-compliance:65"
        name                       = "vol-app-prep-ni-compliance"
      ~ revision                   = 65 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["populate-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-populate-anondb:65" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v6.1.2"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "PP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prep.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.pre.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prep.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "release-v6.1.2"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prep.olcs.dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-populate-anondb:65"
        name                       = "vol-app-prep-populate-anondb"
      ~ revision                   = 65 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-general"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-general:59" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                    # (6 unchanged elements hidden)
                    "--queue-duration",
                  ~ "600" -> "110",
                ]
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v6.1.2"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "PP"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "release-v6.1.2"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-general:59"
        name                       = "vol-app-prep-process-queue-general"
      ~ revision                   = 59 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

      ~ timeout {
          ~ attempt_duration_seconds = 610 -> 120
        }

        # (1 unchanged block hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["sas-mi-extract"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-sas-mi-extract:65" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v6.1.2"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "PP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prep.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.pre.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prep.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "release-v6.1.2"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prep.olcs.dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-sas-mi-extract:65"
        name                       = "vol-app-prep-sas-mi-extract"
      ~ revision                   = 65 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "additional_inline" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "batch:SubmitJob",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cancel-unsubmitted-bilateral:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ch-vs-olcs-diffs:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-clean-up-variations:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-close-expired-windows:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cns:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-company-profile-dlq:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-create-psv-licence-surrender-task:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-delete:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-populate:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-postcheck:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-precheck:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-database-maintenance:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-digital-continuation-reminders:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-duplicate-vehicle-removal:2",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-duplicate-vehicle-warning:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-enqueue-ch-compare:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-expire-bus-registration:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-flag-urgent-tasks:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-users-from-csv:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-inspection-request-email:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-interim-end-date-enforcement:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-international-goods-export:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-last-tm-letter:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-licence-status-rules:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-liquibase:2",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-mark-expired-permits:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-cl:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-company-profile:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-inbox:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-insolvency-dlq:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-insolvency:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-ntu:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-community-licences:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-disc-generation:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-disc-print:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-ecmt-accept:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-irhp-allocate:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-permit-generation:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-permit-print:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-print:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-psv-operator-list-export:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-remove-read-audit:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-resolve-payments:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-system-parameter:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-transxchange-consumer:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-queue/vol-app-prep-default",
              + "arn:aws:batch:eu-west-1:146997448015:job-queue/vol-app-prep-liquibase",
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "batch"
        }
    }

  # module.service.module.eventbridge.aws_iam_policy.additional_inline[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_inline" {
        id               = "arn:aws:iam::146997448015:policy/vol-app-prep-batch-scheduler-inline"
        name             = "vol-app-prep-batch-scheduler-inline"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "batch:SubmitJob"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:batch:eu-west-1:146997448015:job-queue/vol-app-prep-liquibase",
                          - "arn:aws:batch:eu-west-1:146997448015:job-queue/vol-app-prep-default",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-transxchange-consumer:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-system-parameter:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-sas-mi-extract:65",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-resolve-payments:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-remove-read-audit:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-psv-operator-list-export:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-print:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-permit-print:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-permit-generation:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-irhp-allocate:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-general:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-ecmt-accept:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-disc-print:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-disc-generation:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-community-licences:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-ntu:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-insolvency:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-insolvency-dlq:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-inbox:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-company-profile:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-cl:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-populate-anondb:65",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ni-compliance:65",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-mark-expired-permits:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-liquibase:2",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-licence-status-rules:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-last-tm-letter:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-international-goods-export:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-interim-end-date-enforcement:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-inspection-request-email:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-users-from-csv:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-anondb:65",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-flag-urgent-tasks:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-expire-bus-registration:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-enqueue-ch-compare:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-duplicate-vehicle-warning:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-duplicate-vehicle-removal:2",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-digital-continuation-reminders:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-database-maintenance:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-precheck:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-postcheck:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-populate:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-delete:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-create-psv-licence-surrender-task:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-company-profile-dlq:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cns:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-close-expired-windows:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-clean-up-variations:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ch-vs-olcs-diffs:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cancel-unsubmitted-bilateral:59",
                        ]
                      - Sid      = "batch"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Name" = "vol-app-prep-batch-scheduler-inline"
        }
        # (7 unchanged attributes hidden)
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["prep-company-profile-dlq"] will be updated in-place
  ~ resource "aws_scheduler_schedule" "this" {
        id                           = "default/prep-company-profile-dlq-schedule"
        name                         = "prep-company-profile-dlq-schedule"
      ~ schedule_expression          = "cron(0/30 8-17 * * ? *)" -> "cron(0/30 * * * ? *)"
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["prep-flag-urgent-tasks"] will be updated in-place
  ~ resource "aws_scheduler_schedule" "this" {
        id                           = "default/prep-flag-urgent-tasks-schedule"
        name                         = "prep-flag-urgent-tasks-schedule"
      ~ schedule_expression          = "cron(0 8-17 * * ? *)" -> "cron(0 * * * ? *)"
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["prep-licence-status-rules"] will be updated in-place
  ~ resource "aws_scheduler_schedule" "this" {
        id                           = "default/prep-licence-status-rules-schedule"
        name                         = "prep-licence-status-rules-schedule"
      ~ schedule_expression          = "cron(0 8-17 * * ? *)" -> "cron(0 * * * ? *)"
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-company-profile"] will be updated in-place
  ~ resource "aws_scheduler_schedule" "this" {
        id                           = "default/prep-process-company-profile-schedule"
        name                         = "prep-process-company-profile-schedule"
      ~ schedule_expression          = "cron(0/5 8-17 * * ? *)" -> "cron(0/5 * * * ? *)"
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-insolvency"] will be updated in-place
  ~ resource "aws_scheduler_schedule" "this" {
        id                           = "default/prep-process-insolvency-schedule"
        name                         = "prep-process-insolvency-schedule"
      ~ schedule_expression          = "cron(0/30 8-17 * * ? *)" -> "cron(0/30 * * * ? *)"
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-insolvency-dlq"] will be updated in-place
  ~ resource "aws_scheduler_schedule" "this" {
        id                           = "default/prep-process-insolvency-dlq-schedule"
        name                         = "prep-process-insolvency-dlq-schedule"
      ~ schedule_expression          = "cron(0/30 8-17 * * ? *)" -> "cron(0/30 * * * ? *)"
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-community-licences"] will be updated in-place
  ~ resource "aws_scheduler_schedule" "this" {
        id                           = "default/prep-process-queue-community-licences-schedule"
        name                         = "prep-process-queue-community-licences-schedule"
      ~ schedule_expression          = "cron(0/2 8-17 * * ? *)" -> "cron(0/2 * * * ? *)"
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-disc-generation"] will be updated in-place
  ~ resource "aws_scheduler_schedule" "this" {
        id                           = "default/prep-process-queue-disc-generation-schedule"
        name                         = "prep-process-queue-disc-generation-schedule"
      ~ schedule_expression          = "cron(0/2 8-17 * * ? *)" -> "cron(0/2 * * * ? *)"
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-disc-print"] will be updated in-place
  ~ resource "aws_scheduler_schedule" "this" {
        id                           = "default/prep-process-queue-disc-print-schedule"
        name                         = "prep-process-queue-disc-print-schedule"
      ~ schedule_expression          = "cron(0/15 8-17 * * ? *)" -> "cron(0/15 * * * ? *)"
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-ecmt-accept"] will be updated in-place
  ~ resource "aws_scheduler_schedule" "this" {
        id                           = "default/prep-process-queue-ecmt-accept-schedule"
        name                         = "prep-process-queue-ecmt-accept-schedule"
      ~ schedule_expression          = "cron(0/2 8-17 * * ? *)" -> "cron(0/2 * * * ? *)"
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-general"] will be updated in-place
  ~ resource "aws_scheduler_schedule" "this" {
        id                           = "default/prep-process-queue-general-schedule"
        name                         = "prep-process-queue-general-schedule"
      ~ schedule_expression          = "cron(0/2 8-17 * * ? *)" -> "cron(0/2 * * * ? *)"
        # (9 unchanged attributes hidden)

      ~ target {
          ~ input    = jsonencode(
                {
                  - JobDefinition              = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-general:59"
                  - JobName                    = "vol-app-prep-process-queue-general"
                  - JobQueue                   = "arn:aws:batch:eu-west-1:146997448015:job-queue/vol-app-prep-default"
                  - SchedulingPriorityOverride = 1
                  - ShareIdentifier            = "volapp"
                }
            ) -> (known after apply)
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-irhp-allocate"] will be updated in-place
  ~ resource "aws_scheduler_schedule" "this" {
        id                           = "default/prep-process-queue-irhp-allocate-schedule"
        name                         = "prep-process-queue-irhp-allocate-schedule"
      ~ schedule_expression          = "cron(0/2 8-17 * * ? *)" -> "cron(0/2 * * * ? *)"
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-permit-generation"] will be updated in-place
  ~ resource "aws_scheduler_schedule" "this" {
        id                           = "default/prep-process-queue-permit-generation-schedule"
        name                         = "prep-process-queue-permit-generation-schedule"
      ~ schedule_expression          = "cron(0/2 8-17 * * ? *)" -> "cron(0/2 * * * ? *)"
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-permit-print"] will be updated in-place
  ~ resource "aws_scheduler_schedule" "this" {
        id                           = "default/prep-process-queue-permit-print-schedule"
        name                         = "prep-process-queue-permit-print-schedule"
      ~ schedule_expression          = "cron(0/15 8-17 * * ? *)" -> "cron(0/15 * * * ? *)"
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-print"] will be updated in-place
  ~ resource "aws_scheduler_schedule" "this" {
        id                           = "default/prep-process-queue-print-schedule"
        name                         = "prep-process-queue-print-schedule"
      ~ schedule_expression          = "cron(0/2 8-17 * * ? *)" -> "cron(0/2 * * * ? *)"
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["prep-resolve-payments"] will be updated in-place
  ~ resource "aws_scheduler_schedule" "this" {
        id                           = "default/prep-resolve-payments-schedule"
        name                         = "prep-resolve-payments-schedule"
      ~ schedule_expression          = "cron(0/5 8-17 * * ? *)" -> "cron(0/5 * * * ? *)"
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["prep-transxchange-consumer"] will be updated in-place
  ~ resource "aws_scheduler_schedule" "this" {
        id                           = "default/prep-transxchange-consumer-schedule"
        name                         = "prep-transxchange-consumer-schedule"
      ~ schedule_expression          = "cron(0/2 8-17 * * ? *)" -> "cron(0/2 * * * ? *)"
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 0 to add, 23 to change, 0 to destroy.

```

</details>